HELP_MESSAGE = "❓ Не знаешь, что делать ❓ \n\n" \
               "Мы поможем ⤵ \n\n" \
               "1 - Для начала работы нажмите ▶️ /start\n\n" \
               "2 - Для получения инфрмации про бота нажми ❔ /info\n\n" \
               "5 - Если есть вопросы или предложения, пиши разработчикам ⬇ "

HELLO_MESSAGE = "👋 Привет, я - бот для начала изучения языка программирования Python" \
                "Кстати, я даже на нем написан, правда здорово?" \
                "Я очень надеюсь, что мы с тобой подружимся, а пока....\n\n" \
                "Скажи мне, пожалуйста, как тебя зовут?"

INFO_MESSAGE = "📎 Этот бот предназначен для изучения Python. 🇬🇧 \n\n" \
               "Немного расскажу как я работаю\n\nДа-да, я тоже работаю, как и мои разработчики)" \
               "Ты сам распоряжаешься своим временем, поэтому я не буду тебя ограничивать в работе.\n\n" \
               "Захочешь изучить новую тему - пиши ...... команда.....\n\n" \
               "После этой команды, тебе будет представлена теория, небольшие вопросы, и простая (наверное)" \
               " задача. Прости, они для меня просто все как родные, поэтому простые)\n\n" \
               "Но перед каждым действием будет предложен выбор идти дальше или нет\n" \
               "Поэтому все зависит только от тебя!!!\n\nНе бойся, Python - простой!!!\n\n" \
               "🔹 Козлова Ирина (@k_ira_18)"

START_REG_MSG = "! Мы начинаем изучать Python," \
                " мой друг!\n\n" \
                "Немного расскажу как я работаю\n Да-да, я тоже работаю, как и мои разработчики)" \
                "Ты сам распоряжаешься своим временем, поэтому я не буду тебя ограничивать в работе.\n" \
                "Захочешь изучить новую тему - пиши /theme" \
                "После этой команды, тебе будет представлена теория, небольшие вопросы, и простая (наверное)" \
                " задача. Прости, они для меня просто все как родные, поэтому простые)\n\n" \
                "Но каждым действием ты сам руководствуешься, хочешь идти дальше - /theme\n" \
                "Поэтому все зависит только от тебя!!! \nНе бойся, Python - простой!!!"

NOT_THEME = "К сожаления, я пока не придумал еще новых тем, поэтому пока ты можешь отдыхать!"

END1_MSG = "А ты молодец, хорошо справляешься! \n До встречи! 🤗"
END2_MSG = "Я уверен, ты можешь лучше!\n" \
           "В следующий раз обязательно будет больше правильных ответов 😉"
CORRECT_MSG = "Правильно 😀, так держать! 🟢"
WRONG_MSG = "Эх 😔, к сожалению, неправильно 🔴"

UNDERSTAND_MSG = "😔 Я не научился еще понимать твои сообщения," \
                 " поэтому напиши /info или /help " \
                 "если не знаешь, что делать, я помогу 😉"

TIPS1_MSG = " 🥳 Ты сегодня большой молодец, все правильно ответил \n" \
           "Так держать! 💪"
TIPS2_MSG = "Чтобы получить подсказки, ответь на пару вопросов! "

HELP_BUTTON = " Для связи с разработчиком 💬"
READY_BTN = [" Я готов! ✅ ", "Я не готов! ❌"]
BUTTON_ANS = {"1️⃣": 1, "2️⃣": 2, "3️⃣": 3, "4️⃣": 4}
PORTION_QUE = 3
COUNT_QUE = 2
